{
  "basics": {
    "name": "Simone Picciani",
    "label": "Developer/Software Engineer",
    "picture": "photo.jpg",
    "email": "simone.picciani@gmail.com",
    "phone": "+39 349 2190062",
    "website": "http://zanzapla.net/",
    "summary": "Developer with 5+ years of experience using various technologies, I started more as a Help Desk \\ System Administrator figure and gradually moved to a Full Stack Developer. My emphasis is the Frontend, with a strong focus on architectural choices.",
    "location": {
      "address": "Via Soperga 52",
      "postalCode": "20127",
      "city": "Milano",
      "countryCode": "IT",
      "region": "Lombardia"
    },
    "profiles": [
      {
        "network": "Twitter",
        "username": "@zanza00",
        "url": "https://twitter.com/Zanza00"
      },
      {
        "network": "GitHub",
        "username": "zanza00",
        "url": "https://github.com/zanza00"
      }
    ]
  },
  "work": [
    {
      "company": "Cuebiq s.r.l.",
      "position": "Frontend Architect",
      "website": "https://www.cuebiq.com/",
      "startDate": "2019-09-09",
      "endDate": "Present",
      "summary": "Frontend architect that can badly handle everything from CSS to k8s.",
      "highlights": [
        "Maintain and evolve an Express server, written in typescript, that serves the frontend. It also uses virtual services as proxies for the various microservices.",
        "Migrated the custom micro frontend architecture to using personalized single-spa modules. Responsible for the functioning of over 15 micro frontends.",
        "Created and maintains specific libraries for network requests, permission enforcing, jsonschema forms, tracking, error logging, and various utilities.",
        "Maintain Travis CI/CD for frontend projects, with auto-deploy and scripts for promoting between environments.",
        "Help to maintain two instances of Oauth2 Proxy and Keycloack for user authentication.",
        "Help to maintain a custom CLI made to automate boring stuff in the CI/CD environment."
      ]
    },
    {
      "company": "buildo s.r.l.",
      "position": "Software Engineer",
      "website": "https://buildo.io/",
      "startDate": "2018-05-07",
      "endDate": "2019-07-19",
      "summary": "Full stack software engineer using Scala as a backend language and Typescript as a fullstack language with experience with Docker, Docker Compose, Concourse CI, Terraform and AWS",
      "highlights": [
        "Helped to create a React Native app that needed to interface with custom RFID hardware. Managed and assisted the outsourced translation team.",
        "Created a Typescript + NodeJS backend with PostgreSQL as Database that ingested various heterogenous data and exposes a CQRS API endpoints for data. Wrote the CI pipeline for deploying on AWS.",
        "Converted a codebase from Scala to Typescript + NodeJS targeting the same PostgreSQL database and exposing the same Web API, also rewrote the whole build and test pipeline to accomodate the new build.",
        "Helped to integrate an existing Typescript + NodeJS into a custom platform: added support for Single Sign On, integrate product build to the custom platform using Terraform."
      ]
    },
    {
      "company": "Spindox s.p.a.",
      "position": "Developer",
      "website": "https://www.spindox.it/",
      "startDate": "2014-01-01",
      "endDate": "2018-05-04",
      "summary": "Started as Help Desk figure for a Multinational Corporation and successfully transitioned to a developer role. As a Developer I worked on Java projects (Spring, Akka), on hybrid apps (Cordova, Ionic 2) and pure frontend (Mithril, React).",
      "highlights": [
        "Create and develop two hybrid apps and one mobile sites using React Web, modified existing Cordova plugins for better handling the specific scenarios requested by the client",
        "Realized AEM components, using Mithril and Java, for an international site.",
        "Helped to create a multitude of different applications using Ionic 2, targeting challenging environments with a strict timetable.",
        "Realized a Dashboard focused on production defects, using interactive charts. Created a custom parser for data ingestion in Scala"
      ]
    },
    {
      "company": "TheSax s.r.l.",
      "position": "CED office at Clinica San Carlo, Istituto Auxologico Italiano",
      "startDate": "2011-11-01",
      "endDate": "2013-07-31",
      "summary": "Classic Help Desk figure in a medical clinic. Also, assisted in the migration of IT to Istituto Auxologico Italiano's standards. This position was held in conjunction with the part time of Studio Serra."
    },
    {
      "company": "Studio Serra s.r.l.",
      "position": "Responsabile of IT systems / Secretary",
      "startDate": "2009-01-01",
      "endDate": "2013-12-28",
      "summary": "Hired by a small family business as an IT technician. The main purpose was to upgrade the IT infrastructure and digitize paper documents. In September 2011 the role was downsized to part time and then gradually shifted to secretary activity."
    }
  ],
  "volunteer": [
    {
      "organization": "Python Milano",
      "position": "Organizer",
      "website": "http://milano.python.it",
      "startDate": "2015-01-01",
      "endDate": "Present",
      "summary": "Organizer and support logistics for Python Milano's Meetups.",
      "highlights": [
        "Created first iteration of 'PyGlialo', a software written completely in Python for the extraction of the various random prizes.",
        "Implemented site's graphic."
      ]
    },
    {
      "organization": "Milano TS",
      "position": "Assistant Organizer",
      "website": "https://www.meetup.com/MilanoTS/",
      "startDate": "2018-06-01",
      "endDate": "Present",
      "summary": "Organizer and support logistics for Milano TS' Meetups."
    },
    {
      "organization": "Milano JS",
      "position": "Assistant Organizer",
      "website": "https://milanojs.com/",
      "startDate": "2017-01-01",
      "endDate": "Present",
      "summary": "Support logistics for Milano JS' Meetups.",
      "highlights": [
        "Admin for ItaliaJS Discord",
        "Helper for logistics of the various meetups"
      ]
    }
  ],
  "education": [
    {
      "institution": "Università Bicocca",
      "area": "Faculty of Computer Science",
      "studyType": "",
      "startDate": "2006-10-01",
      "endDate": "2009-07-31",
      "gpa": "Did Not Finish."
    }
  ],
  "skills": [
    {
      "name": "TypeScript",
      "level": "Competent",
      "keywords": ["React", "Functional Programming", "NodeJS"]
    },
    {
      "name": "NodeJS",
      "level": "Competent",
      "keywords": ["Express", "PostgreSQL", "Functional Programming"]
    },
    {
      "name": "JavaScript",
      "level": "Competent",
      "keywords": ["ES2015+", "SASS", "React", "React Native"]
    },
    {
      "name": "Kubernetes",
      "level": "Early",
      "keywords": ["kubectl", "Helm"]
    }
  ],
  "languages": [
    {
      "language": "Italian",
      "fluency": "Native speaker"
    },
    {
      "language": "English",
      "fluency": "Fluent (C1 equivalent)"
    }
  ],
  "interests": [
    {
      "name": "Bicycle"
    },
    {
      "name": "Movies"
    },
    {
      "name": "Comic Books"
    },
    {
      "name": "Technology Gadgets"
    },
    {
      "name": "Video Games"
    }
  ]
}
